package com.pastir.storage;

import com.google.firebase.database.DataSnapshot;
import com.google.firebase.database.DatabaseError;
import com.google.firebase.database.DatabaseReference;
import com.google.firebase.database.FirebaseDatabase;
import com.google.firebase.database.ValueEventListener;
import com.pastir.model.ActionBar;
import com.pastir.model.Event;
import com.pastir.model.HomeListItem;
import com.pastir.model.MorningVerse;
import com.pastir.model.MotivationalSticker;
import com.pastir.model.OnHomeListItemsLoadedListener;
import com.pastir.presenter.HomeListItemPresenter;

import java.util.ArrayList;
import java.util.Calendar;
import java.util.List;

/**
 * This is a singleton class that is used by the app to communicate between memory and maintain
 * some objects throught the app
 */

public class DataSource {

    private static DataSource sInstance;
    private ActionBar mActionBar;
    private DatabaseReference mDatabase;

    private List<Event> mEvents;
    private List<MotivationalSticker> mStickers;

    /**
     * @return Current action bar that's linked with the Activity's toolbar or initializes one if
     * there isn't a current action bar
     */
    public ActionBar getActionBar() {
        if (mActionBar == null)
            mActionBar = new ActionBar();
        return mActionBar;
    }

    private DataSource() {
        mDatabase = FirebaseDatabase.getInstance().getReference();
    }

    public static DataSource getInstance() {
        if (sInstance == null)
            sInstance = new DataSource();
        return sInstance;
    }


    public void getMotivationalStickers(OnHomeListItemsLoadedListener listener) {
        getItemsFromFirebase(listener, mStickers, "stickers", MotivationalSticker.class);
    }

    public void getEvents(OnHomeListItemsLoadedListener listener) {
        getItemsFromFirebase(listener, mEvents, "events", Event.class);
    }

    private <T extends HomeListItem> void getItemsFromFirebase(final OnHomeListItemsLoadedListener listener, List<T> items, String path, final Class aClass) {
        if (items != null && items.size() > 0) { //Exit case
            listener.onHomeListItemsLoaded(items);
            return;
        }

        mDatabase.child(path).addValueEventListener(new ValueEventListener() {

            @Override
            public void onDataChange(DataSnapshot dataSnapshot) {
                for (DataSnapshot snapshot : dataSnapshot.getChildren()) { //For every child
                    if (aClass == Event.class) {
                        getEventList().add(Event.parse(snapshot));//Parse that child into event and add it to the list
                    } else {
                        getStickerList().add(MotivationalSticker.parse(snapshot));
                    }
                }
                listener.onHomeListItemsLoaded(aClass == Event.class ? mEvents : mStickers);
            }

            @Override
            public void onCancelled(DatabaseError databaseError) {

            }
        });
    }


    private List<Event> getEventList() {
        if(mEvents == null)
            mEvents = new ArrayList<>();
        return mEvents;
    }

    private List<MotivationalSticker> getStickerList() {
        if(mStickers == null)
            mStickers = new ArrayList<>();
        return mStickers;
    }

    public List<MorningVerse> getMorningVerses() {
        List<MorningVerse> result = new ArrayList<>();
        MorningVerse event = new MorningVerse();
        event.setId(0);
        event.setTitle("Под Божјом управом");
        event.setDescription("»Проговори Данило и рече: Да је благословено име Господње од вијека до вијека: јер је Његова мудрост и сила; и Он мијења времена и доба; смеће цареве, и поставља цареве; даје мудрост мудрима и разум разумнима.« Данило 2,20.21.");
        event.setDate("01.09.2017");
        event.setText("»Погледајте јудејског заробљеника, смиреног и спокојног, у присутности владара најмоћније светске империје! Својим првим речима одбио је да част припише себи, а уздигао је Бога као Извор сваке мудрости. На забринуто царево питање: ’Можеш ли ми казати сан који сам снио и шта значи?’ Данило је одговорио: ’Тајне које цар иште не могу казати цару мудраци ни звездари ни врачари ни гатари, него има Бог на Небу који открива тајне и јавља цару Навуходоносору шта ће бити до послетка.’...\n" +
                "У аналима људске историје, јачање народа, појављивање и падање империја, наизглед зависе од човекове воље и вештине; обликовање догађаја, у великој мери, изгледа као резултат његове моћи, амбиције или ината. Међутим, у Божјој речи завеса је повучена у страну, тако да, у свим играма и противиграма људских интереса, сила и страсти, изнад њих и иза њих, видимо оруђа Свемилостивога која тихо и стрпљиво остварују намере Његове воље...\n" +
                "У историји народа истраживачи Божје речи могу да прате дословно испуњавање божанских пророчанстава. Вавилон, на крају уздрман и сломљен, нестао је зато што су се његови властодршци у свом благостању сматрали независним од Бога, док су славу свога царства приписивали људским достигнућима... Царства која су затим настала била су још гора и покваренија; падала су све ниже на лествици моралних вредности.\n" +
                "Власт свих управљача на Земљи потиче са Неба; од начина на који се служе влашћу зависи и њихов успех... Препознати остварење тих начела у испољавању божанске силе која ’уклања цареве и поставља цареве’, значи схватити филозофију историје.« (Историја пророка и царева, стр. 494-502. оригинал)");
        result.add(event);

        event = new MorningVerse();
        event.setId(1);
        event.setTitle("Вавилонски вођа");
        event.setDate("02.09.2017");
        event.setText("»Данило је потражио Господа када је била издата наредба да се побију сви мудраци у Вавилонском царству зато што нису знали да испричају ни протумаче сан који је цар заборавио. Навуходоносор је тражио не само тумачење сна, већ и однос самог сна... Они су изјавили да је царева заповест неразумна, и да проба превазилази све што је икад било захтевано од било којег човека. Цар се разгневио, и поступио исто као и сви људи који имају велику власт и неукроћене страсти. Одлучио је да се сви они погубе, а пошто су се Данило и његови другови убрајали међу мудраце, требало је да поделе њихову\n" +
                "судбину.« (Синови и кћери Божје, стр. 214)\n" +
                "»Данило је био испуњен Духом Исуса Христа и молио се да вавилонски мудраци не буду побијени. Христови следбеници не поседују сотонине особине, које наводе људе да се радују болу и патњи Божјих створења. Они имају дух свог Учитеља који је рекао: ’Ја сам дошао да нађем и спасем што је изгубљено. Нисам дошао да дозовем праведнике него грешнике на покајање. Да је Данило поседовао онај исти религиозни жар који се данас у црквама брзо разгори и којим су људи вођени када муче, тлаче и уништавају оне који не служе Богу према њиховом одређеном плану, он би рекао Ариоху: ’Ови људи који тврде за себе да су мудраци обмањују цара. Они не поседују знање које твдре да имају, и треба да буду погубљени. Они не поштују небеског Бога, служе идолима и њихов живот ни на који начин не одаје част Богу; нека умру; али мене изведи пред цара и ја ћу му протумачити сан.’ Преображавајућа Божја благодат показала се у Његовом слузи, који се најискреније молио за живот управо оних људи који су касније потајно ковали планове да му одузму живот. Ови људи постали су љубоморни на Данила зато што је стекао наклоност цара и кнезова и био поштован као највећи човек у Вавилону.« (Letter 90, 1894)\n");
        event.setDescription("»Него има Бог на Небу који открива тајне и јавља цару Навуходоносору шта ће бити до посљетка.« Данило 2,28.");
        result.add(event);

        event = new MorningVerse();
        event.setId(2);
        event.setTitle("Четири младића у ужареној пећи");
        event.setDate("03.09.2017");
        event.setText("»Међутим, Бог није заборавио своје. Када су Његови сведоци били бачени у пећ, Спаситељ им се лично показао и заједно су почели да ходају усред огња. У присутности Господара врућине и хладноће, пламен је изгубио уништавајућу моћ. Цар је са свог престола посматрао догађаје, очекујући да ће људи који су му одрекли послушност бити заувек уништени. Али, његово победничко осећање изненада се променило. Племићи, који су стајали око њега, видели су да му је лице побледело, када је устао са престола и напрегнуто се загледао у распламсане пламенове. Уплашени владар окренуо се према својим доглавницима и упитао: ’Не бацисмо ли три човека свезана у огањ... Ено, видим четири човека одрешена где ходе посред огња и није им ништа, а четврти као да је Син Божји?’ Како је овај незнабожачки владар могао да препозна Божјег Сина? Јеврејски заробљеници, који су заузимали поверљива места у Вавилону, својим животом и карактером представљали су му истину. Када су били позвани да објасне разлоге своје вере, одговарали су без оклевања. Једноставно и отворено објављивали су начела праведности, учећи тако све око себе о Богу коме су служили. Говорили су о Христу, Спаситељу који ће доћи; у лику Четвртога усред огња цар је препознао Божјег Сина...\n" +
                "Онај који је ходао с јеврејским јунацима по ужареној пећи биће са својим следбеницима где год да се нађу. Његова стална присутност тешиће их и помоћи да опстану. Усред времена невоље, невоље какве није било од почетка времена, Његови изабраници остаће непоколебани. Сотона, са свим својим злим четама, неће моћи да уништи ни најслабијега између Божјих светих. Анђели, који су силни крепошћу, заштитиће их и њих ради Господ ће се открити као ’Бог над боговима’, моћан да заувек спасе оне које се у Њега уздају.« (Историја пророка и царева, стр. 508-513. оригинал)");
        event.setDescription("»Ево, Бог наш, којему ми служимо, може нас избавити из пећи огњене, ужарене; и избавиће нас из твојих руку, царе.« Данило 3,17.");
        result.add(event);

        event = new MorningVerse();
        event.setId(3);
        event.setTitle("Навуходоносор понижен");
        event.setDate("04.09.2017");
        event.setText("»Последњи сан који је Бог дао Навуходоносору и царево искуство у вези са њим садрже поуке од пресудне важности за све оне који раде у Божјем делу. Цара је мучио један сан, који је очигледно предвиђао неку невољу, и кога нико од његових мудраца није успео да\n" +
                "протумачи. Верни Данило стао је пред цара, али не да би му упутио ласкаве речи, нити да би погрешним тумачењем сна осигурао цареву наклоност. Свечана дужност почивала је на њему да вавилонском цару каже истину...\n" +
                "Навуходоносор није обратио пажњу на поруку послату с неба. Годину дана након што је примио опомену, шетајући палатом, рекао је у себи: ’Није ли то Вавилон велики што га ја сазидах?’ Небески Бог прочитао је царево срце и чуо речи хвале које је шапатом упутио\n" +
                "себи... ’Глас дође с неба... Царство се узе од тебе. И бићеш прогнан између људи, и живјећеш са звијерјем пољским, храниће те травом као говеда, и седам ће времена проћи преко тебе докле познаш да Вишњи влада царством људским и даје га коме хоће. У тај час испуни се та ријеч на Навуходоносору.’« (The Review and Herald, 8 септембар 1896)\n" +
                "»У раздобљу од седам година Навуходоносор је служио као чудо свим својим поданицима; у току седам година био је понижаван пред очима целог света. А онда му се вратио разум и он је, понизно се обративши Богу небеском, признао да је Божја рука управљала његовим кажњавањем. У јавном прогласу, признао је своју кривицу и да\n" +
                "га је само велика Божја милост вратила на положај...\n" +
                "Божја намера да највећа царства света треба да Му одају славу, сада се испунила. Овај јавни проглас, у коме је Навуходоносор признао Божју милост, доброту и власт, било је последње дело у његовом животу које је света историја забележила.« (Историја пророка и царева, стр. 520.521. оригинал)");
        event.setDescription("»И сви становници земаљски ништа нијесу према Њему, и ради шта хоће с војском небеском и са становницима земаљским, и нема никога да би Му руку уставио и рекао му: Шта радиш?« Данило 4,35.");
        result.add(event);

        event = new MorningVerse();
        event.setId(4);
        event.setTitle("Данило, Божји изасланик");
        event.setDate("05.09.2017");
        event.setText("ни мане.«Данило 6.4.\n" +
                "»Данило, први човек у влади највећег светског царства, био је истовремено и Божји пророк, који је добијао светлост божанског надахнућа. Човек који је имао исте страсти као и ми, описан је надахнутим пером као биће без мане. Његови пословни подухвати, упркос најоштријој провери његових непријатеља, били су без мане. Он је пример онога\n" +
                "што може да постане сваки пословни човек, када се његово срце обрати и посвети Богу и када његове побуде постану праве пред Богом...\n" +
                "Непоколебљив у својој верности Богу, непопустљив у свом владању над собом, Данило је, својим племенитим достојанством и својим непоколебљивим поштењем, иако још млад, задобио ’љубав и милост’ незнабожачког службеника под чију је управу био стављен (Данило 1,9). Исте одлике обележавале су и његов каснији живот. Брзо се уздигао до положаја првог службеника у Вавилонском царству. У току владавине неколико владара, пропадања државе и успостављања новог светског царства, такве су биле његова мудрост и државничка вештина, тако савршена његова тактичност, његова учтивост, његова истинска доброта срца, његова верност начелима, да су чак и његови непријатељи били приморани да признају да на њему не могу ’наћи примедбе ни погрешке, јер беше веран’. Људи су Данилу указали част да носи државничке одговорно сти и чува тајне царстава светског значаја, али и Бог му је указао част одређујући га да буде Његов изасланик и дајући му многа откривења о тајнама будућих векова. Своја предивна пророчанства, која је сам записао у књизи која носи његово име, од седмог до дванаестог поглавља, ни он сам није могао у потпуности да схвати; али пре него што је његово животно дело било завршено, добио је благословено обећање да ће ’на крају дана’, у завршном раздобљу историје овога света, добити дозволу да се поново појави на свом месту и у свом делу...\n" +
                "И ми, као Данило и његови другови, можемо да живимо за оно што је истинито, племенито и непролазно. Учећи у овом животу начела царства нашега Господа и Спаситеља... можемо се припремити да приликом Његовог доласка уђемо заједно с Њим кроз врата у Град.« (Историја пророка и царева, стр. 546-548. оригинал)");
        event.setDescription("»Тада старјешине и управитељи гледаху како би нашли што да забаве Данилу због царства; али не могаху наћи забаве ни погрјешке, јер бјеше веран, и не налажаше се у њега погрјешке");
        result.add(event);

        event = new MorningVerse();
        event.setId(5);
        event.setTitle("Бог је послао свог анђела");
        event.setDate("06.09.2017");
        event.setText("»Данило је био постављен на високу дужност. Зли анђели, увек спремни да оптуже човека, подстицали су завист и љубомору управитеља и кнезова... Ови сотонини агенти желели су да његову верност Богу искористе за његово уништење...\n" +
                "Цар није знао за ову подмуклу заверу против Данила. Данило се чак и када је сазнао за царев декрет и даље молио Богу поред отвореног прозора. Он је упућивање молитве Богу сматрао толико важним да би радије жртвовао живот него да се тога одрекне.« (Testimonies for the Church 1:295.296)\n" +
                "»Бог није спречио Данилове непријатеље да га баце у лавовску јаму; дозволио је злим анђелима и поквареним људима да у тој мери изврше своју намеру; али само зато да би избављење свога слуге учинио још запаженијим, а пораз непријатеља истине и правде још потпунијим... Храброшћу тог једног јединог човека, који је одлучио да стане на страну правде уместо на страну државне политике, сотона је требало да буде побеђен и да се Божје име уздигне и прослави. Следећег јутра, у рану зору, цар Дарије је пожурио до јаме и повикао: ’Жалосним гласом... Данило, слуго Бога живога, Бог твој, којему служиш без престанка, може ли те избавити од лавова?’ Глас пророка му је одговорио: ’Царе, да си жив довека! Бог мој посла анђела својега и затвори уста лавовима, те ми не наудише!’... Данило у лавовској јами био је онај исти Данило, који је стајао пред царем као старешина високих државних службеника и као пророк Највишега. Човек чије срце се ослања на Бога биће исти у време своје највеће невоље као и у доба благостања, када га је обасјавала светлост божанске и људске наклоности... Сила која је близу да избави од физичких незгода и невоља исто је тако близу да спасе од већих зала, омогућујући Божјем слузи да сачува поштење и честитост у свим околностима и да побеђује уз помоћ божанске благодати.« (Историја пророка и царева, стр. 543-545. оригинал)");
        event.setDescription("»Тада цар рече те доведоше Данила и бацише га у јаму лавовску; и цар проговори и рече Данилу: Бог твој, којему без престанка служиш, нека те избави.« Данило 6,16.");
        result.add(event);

        event = new MorningVerse();
        event.setId(6);
        event.setTitle("Подела терета");
        event.setDate("07.09.2017");
        event.setText("»Данило је поново почео да проучава пророчанства пророка Јеремије, и даље забринут за судбину Израиља. Она су била врло јасна – тако јасна да је на темељу тих сведочанстава, записаних у књизи, схватио ’број година, које беше рекао Господ Јеремији пророку да ће\n" +
                "се навршити развалинама јерусалимским, седамдесет година’. (Данило 9,2)\n" +
                "Са вером која се темељила на сигурној пророчкој речи, Данило је почео да се моли да Бог што пре испуни своја обећања. Молио се да Божја част остане неокрњена. У својим молитвама потпуно се изједначио са онима који нису успели да остваре божанске намере, признајући њихове грехе као своје.« (Историја пророка и царева, стр. 554.555. оригинал)\n" +
                "»Каква је молитва сишла са Данилових усана! Какву је понизност душе открила! Топлина небеског огња могла се препознати у речима које су се уздизале Богу. Небо је одговорило на молитву шаљући свог гласника Данилу. Молитве упућене на исти начин у данашње време извојеваће победе са Богом. ’Непрестана молитва праведнога много може помоћи.’ Као и у стара времена, када су молитве биле упућиване и огањ се спуштао са Неба и спаљивао жртву на олтару, тако ће као одговор на нашу молитву, небески огањ ући у нашу душу. Светлост и сила Светога Духа уселиће се у нас...\n" +
                "Немамо ли и ми исту велику потребу да се обратимо Богу као Данило? Обраћам се онима који верују да живимо у последњем раздобљу овоземаљске историје. Позивам вас да на своје душе преузмете терет наших цркава, школа и установа. Бог који је чуо Данилову молитву чуће и нашу када му приђемо скрушеног срца. Наше потребе су исто толико хитне и наше тешкоће велике. Истом снагом треба да тежимо циљу и у вери изнесемо свој терет пред великог Носиоца терета. Потребно је да срца у наше време буду исто толико дубоко дирнута као и у време у коме се Данило молио.« (The Review and Herald, 9 фебруар 1897)");
        event.setDescription("»И окретох лице своје ка Господу Богу тражећи Га молитвом и молбама с постом и с костријети и пепелом. И помолих се Господу Богу својему исповиједајући се.« Данило 9,3.4.");
        result.add(event);

        event = new MorningVerse();
        event.setId(7);
        event.setTitle("Божја рука све покреће");
        event.setDate("08.09.2017");
        event.setText("»Господ има своје изворе. Његова рука све покреће. Када је дошло време да се поново обнови Његов храм, Бог је деловао на Кира као на свог слугу да схвати пророчанства која се односе на њега, и осигура слободу јеврејском народу.« (The S.D.A. Bible Commentary 4:1175)\n" +
                "»Данилово избављење из лавовске јаме, Бог је искористио да позитивно утиче на мисли Кира Великог... Када је цар прочитао речи које су, више од стотину година пре његовог рођења, најавиле да ће Вавилон бити освојен, када је чуо поруку коју му је упутио Владар свемира... његово срце је било дубоко дирнуто, и зато је одлучио да обави мисију коју му је божанска воља одредила. Ослободиће јудејске заробљенике и помоћи им да обнове Храм Господу! Писаним прогласом објављеним ’по свему царству својему’, Кир је обелоданио своју намеру да се побрине за повратак Јевреја и за обнављање њиховог Храма... Гласови о овом прогласу стигли су и у најудаљеније провинције у царству и међу прогнаницима је завладала велика радост. Многи, слично Данилу, проучавали су пророчанства, тражили Господа и молили се да испуни своје обећање о залагању у корист Сиона... Зоровавељу, потомку цара Давида, Кир је поверио одговорност заповедника групе која се враћала у Јудеју; са њиме је удружио и Исуса, сина Јоседекова, првосвештеника. Дуго путовање преко пустињских пространстава протекло је срећно и радосна група, захвална Богу на Његовим многоструким благословима, одмах се прихватила посла да поново подигне оно што је било разорено и уништено.« (Историја\n" +
                "пророка и царева, стр. 557-559. оригинал)\n" +
                "»Господ Бог Сведржитељ царује. Сви цареви, сви народи, Његови су, под Његовом су влашћу и управом. Његови извори су бесконачни. Мудри човек је рекао: ’Срце је царево у руци Господу као потоци водени; куда год хоће, савија га.’ Он који ’даје спасење царевима’ будно посматра оне од чијих дела зависе судбине народа.« (The S.D.A. Bible Commentary 4:1170)");
        event.setDescription("»Говорим Киру: Пастир си Мој; и извршиће сву вољу Моју, и казаће Јерусалиму: Сазидаћеш се; и Цркви: Основаћеш се.« Исаија 44,28.");
        result.add(event);

        event = new MorningVerse();
        event.setId(8);
        event.setTitle("Препреке су проба вере");
        event.setDate("09.09.2017");
        event.setText("»Приликом обнављања Господњег дома, Зоровавељ се суочавао с многоструким тешкоћама. Од самог почетка, противници су ’досађивали народу Јудину и сметали му у зидању’, ’те им забранише оружаном силом’. Међутим, Господ се умешао и стао на страну градитеља, проговорио је преко свог пророка и рекао Зоровавељу: ’Шта си ти, горо велика, пред Зоровавељом? Равница’... У току целокупне историје Божјег народа велике планине тешкоћа, наизглед непрелазне, уздизале су се пред онима који су се трудили да изврше намере Неба. Господ дозвољава такве препреке да се окуша наша вера. Када смо притешњени са свих страна, тада је најбоље време да се поуздамо у Бога и силу Његовог Духа. Учвршћивање живе вере повећава духовну снагу и развија непоколебљиво поверење. На тај начин душа стиче снагу да победи. Пред јуришима вере нестају препреке које сотона ставља на пут хришћанину; јер му и силе Неба долазе у помоћ. ’И ништа вам неће бити немогуће!’ У свету постоји обичај да се сваки почетак обележи раскошно и хвалисаво. Бог жели да дан малих ствари буде почетак славне победе истине и праведности. Он понекад челичи своје раднике дозвољавајући да прођу кроз разочарања и привидне неуспехе. Његова је намера да науче да савладају тешкоће.\n" +
                "Људи су често у искушењу да поклекну пред невољама и препрекама с којима се суочавају. Међутим, ако од самог почетка па све до краја одрже своје поверење, Бог ће им прокрчити пут... Пред Зоровавељевим неустрашивим духом и непоколебљивом вером велике планине тешкоћа претвориће се у равницу; руке Онога који је поставио темељ, ’руке ће његове и довршити’ посао.« (Историја пророка и царева, стр. 594.595. оригинал)");
        event.setDescription("»Јер ко је презрео дан малијех ствари?« Захарија 4,10.");
        result.add(event);

        event = new MorningVerse();
        event.setId(9);
        event.setTitle("Јездра, ученик и учитељ");
        event.setDate("10.09.2017");
        event.setText("»Рођен као припадник Ароновог потомства, Јездра је добио свештеничко образовање. Познавао је, осим тога, и списе мага, астролога и мудраца из Медо–Персијског царства. Међутим, није био задовољан својим духовним стањем. Чезнуо је да успостави потпуни\n" +
                "склад са Богом, чезнуо је за мудрошћу која ће му помоћи да оствари божанску вољу... То га је навело да се посвети марљивом проучавању историје Божјег народа, записаној у списима пророка и царева. Претраживао је историјске и поетске делове Библије да схвати зашто је Бог дозволио да Јерусалим буде разорен и да Његов народ буде одведен у ропство у далеку незнабожачку земљу...\n" +
                "Проучавао је упутства објављена на Синају и у току дугог раздобља лутања пустињом. Јездрино срце било је дирнуто док је све више и више упознавао Божје поступање према својој деци, док је све боље схватао светост Закона који је био објављен на Синају. Доживео је ново и потпуно обраћење и одлучио да пажљиво проучи извештаје из свете историје и да то знање искористи тако да донесе благослов и светлост свом народу.\n" +
                "Јездра се потрудио да своје срце припреми за посао који му је, бар по његовом уверењу, предстојао. Искрено је тражио Господа и молио се да буде мудар учитељ у Израиљу. И док је учио да свој ум и своју вољу покори божанској контроли, његов живот био је обогаћен начелима правог посвећења, која су током каснијих година имала позитиван утицај, не само на младе који су тражили његову помоћ, већ и на све остале коју су долазили у додир с њим...\n" +
                "Јездра је постао Божји представник, учио је људе који су живели око њега начелима која владају Небом... Без обзира да ли се налазио у близини двора медоперсијског цара или у Јерусалиму, посао учитеља сматрао је својим основним животним звањем. Док је другима преносио истине које је научио, повећавала се његова радна способност. Постао је човек побожности и ревности. Био је Господњи сведок свету, сведочећи о сили библијске истине која оплемењује човеков свакодневни живот« (Историја пророка и царева, стр. 608.609. оригинал)");
        event.setDescription("»Јездра бјеше управио срце своје да истражује закон Господњи и да га извршује.« Јездра 7,10.");
        result.add(event);

        event = new MorningVerse();
        event.setId(10);
        event.setTitle("Знање захтева деловање");
        event.setDate("11.09.2017");
        event.setText("»»Прошло је више од две хиљаде година откако је Јездра ’управио срце своје да истражује закон Господњи и да га извршује’, али протицање времена није ослабио утицај његовог побожног примера. Током многих столећа извештај о његовом посвећеном животу надахњивао је многе да одлуче да ’истражују закон Господњи и да га извршавају’.\n" +
                "Јездрине побуде биле су узвишене и свете; у свему што је чинио био је покренут дубоком љубављу према душама. Саучешће и нежност које је он показивао према онима који су грешили, или намерно или због незнања, требало би да буду очигледан пример свима који се труде да спроведу реформе... Не може се говорити о слабљењу или јачању Господњег закона. Какав је увек био, такав ће и остати. Он је увек постојао и увек ће\n" +
                "постојати као праведан, добар и савршен сам по себи. Он се не може укинути ни променити. ’Дати му част’ или га ’осрамотити’, то су само људски појмови!...\n" +
                "Хришћани се морају припремати за оно што ће ускоро задесити свет као највеће изненађење, а то припремање треба да обаве марљивим проучавањем Божје речи и настојањем да свој живот усагласе с њеним прописима. Велика питања вечности захтевају од нас нешто више од само неке умишљене религије, религије речи и обличја побожности, у којој истина остаје у предворју срца...\n" +
                "Ако су свети у Старом завету давали тако блиставо сведочанство о верности, зар не би требало да и они које је обасјала нагомилана светлост векова дају још значајније сведочанство о сили истине?« (Историја пророка и царева, стр. 623-626. оригинал)\n" +
                "»Хоћемо ли дозволити да нас Јездрин пример научи како бисмо морали да користимо своје познавање Светог писма? Живот овог Божјег слуге требало би да нам буде надахнуће да служимо Господу срцем, умом и снагом. Свако од нас има одређени посао, а он се може постићи само посвећеним напорима. Морамо прво прионути да сазнамо Божје захтеве, а затим их спроводити у живот. Тада можемо сејати семе истине које ће уродити плодом за вечни живот.« (The S.D.A. Bible Commentary 3:1134)");
        event.setDescription("»Тај Јездра... бијаше књижевник вјешт закону Мојсијеву, који даде Господ Бог Израиљев.« Јездра 7,6.");
        result.add(event);

        event = new MorningVerse();
        event.setId(11);
        event.setTitle("Бог је њихов заштитник");
        event.setDate("12.09.2017");
        event.setText("»Јездрина вера да ће Бог учинити велико дело за свој народ, навела га је да Артаксерксу говори о својој жељи да се врати у Јерусалим, оживи занимање према проучавању Божје речи и помогне својој браћи у обнављању Светог града. Цар је дубоко дирнут слушао, док\n" +
                "је Јездра изражавао своје неограничено поуздање у Бога Израиљевог, у Његову неограничену могућност да заштити свој народ... Прогласио га је посебним представником Медо–Персијског царства и дао му велика овлашћења за остварење намера које су му биле на срцу... Тако је Јудејцима у расејању поново била пружена могућност да се врате у земљу са чијим су поседовањем била везана обећања дому Израиљеву... Пред њима је било путовање које ће потрајати неколико месеци.\n" +
                "Људи су са собом узимали своје жене и децу и своју имовину, осим великог блага које је било намењено Храму и његовим службама. Јездра је био свестан да га на путу чекају непријатељи; спремни да опљачкају и униште и њега и његово друштво, али од цара није тражио никакву оружану пратњу...\n" +
                "У овом случају, Јездра и његови пратиоци видели су прилику да прославе Божје име пред незнабошцима. Вера у моћ живога Бога ојачаће уколико сами Израиљци сада покажу неограничену веру у свог божанског Вођу. Одлучили су стога да се потпуно ослоне на Њега. Неће тражити никакву војничку пратњу. Незнабошцима неће пружити ниједну прилику да људској снази припишу славу која припада једино Богу. Нису могли да дозволе да се у мислима њихових незнабожачких пријатеља појави макар и трачак сумње у искреност њиховог ослањања на Бога својих отаца... Једино када пред очима буду имали Господњи закон, када се буду трудили да га испуне, биће заштићени...\n" +
                "’Тако постисмо и молисмо Бога својега за то, и умолисмо Га.’« (Историја пророка и царева, стр. 609-616. оригинал)");
        event.setDescription("»Јер ме бијаше стид искати од цара војске и коњика да нас бране од непријатеља путем, јер бијасмо рекли цару говорећи: Рука је Бога нашега на добро над свима који Га траже, и јачина је Његова и гњев на све који Га остављају.« Јездра 8,22.");
        result.add(event);

        event = new MorningVerse();
        event.setId(12);
        event.setTitle("Света намера");
        event.setDate("13.09.2017");
        event.setText("»Немија, један од јеврејских изгнаника, заузимао је утицајан и угледан положај на персијском двору. Као царев пехарник слободно се кретао у царевој близини... Преко тог човека... Бог је намеравао да донесе благослов припадницима свог народа у земљи њихових отаца...\n" +
                "Јеврејски родољуб сазнао је да су у Јерусалиму, изабраном граду, настали тешки дани... Изгнаници који су се вратили трпели су невољу и срамоту... Дело обнављања је заустављено, службе у Храму ометане, а народ у сталном страху, јер је највећи део градских зидова и даље био у развалинама...\n" +
                "Немија је своју душу често изливао пред Богом молећи се за свој народ. Међутим, сада, док се молио, света намера почела је да се обликује у његовим мислима. Одлучио је да ће, уколико добије дозволу од цара, уколико набави алат и материјал, сам преузети задатак обнављања јерусалимских зидина...\n" +
                "Четири месеца Немија је чекао повољну прилику да свој захтев изнесе цару... Морао је да обави свети задатак и била му је неопходна царева помоћ; схватио је да од начина на који представи своју жељу, зависи да ли ће добити цареву дозволу и осигурати његову подршку. ’Тада се помолих Богу небескоме’, каже он. За време те кратке молитве Немија је ступио у близину Цара над царевима и на своју страну привукао силу која може да обрати срца као што се обраћају речни токови. У околностима у којима остали облици молитве нису могући, молитва коју је Немија упутио у часу своје потребе је средство којим хришћанин може да располаже... У часу изненадне тешкоће или опасности, душа може да се обрати Ономе, који је обећао да ће прискочити у помоћ својим верним и оданим следбеницима, када год завапе к Њему. У свим околностима, у свим приликама, душа оптерећена жалошћу и бригама, или под ударом сурових кушања, може да нађе\n" +
                "сигурност, подршку и помоћ у непресушној љубави и сили Бога који држи свој завет.« (Историја пророка и царева, стр. 628-632. оригинал)");
        event.setDescription("»Ох, Господе, нека буде ухо Твоје пригнуто к молитви слуге Твојега... и дај данас срећу слузи својему и учини да нађе милост пред овијем човјеком.« Немија 1,11.");
        result.add(event);

        event = new MorningVerse();
        event.setId(13);
        event.setTitle("Човек спреман за рад");
        event.setDate("14.09.2017");
        event.setText("»Немија није седео скрштених руку, док је вапио Богу за помоћ, сматрајући да нема више никаве бриге ни одговорности у остваривању своје намере да обнови Јерусалим. Разборитошћу достојном дивљења и пажљивим планирањем, наставио је припреме да обезбеди успех тог подухвата...\n" +
                "Пример овог светог човека треба да послужи као поука свим Божјим људима да не треба само да се моле у вери, већ да марљиво и верно раде. Са колико тешкоћа се сусрећемо и колико ометамо деловање Провиђења у нашу корист само зато што сматрамо да разборитост, предвиђање и планирање до најситнијих детаља нема много заједничког са религијом. Ово је велика грешка. Наша је дужност да негујемо и користимо сваку силу која ће нас учинити успешнијим радником за Бога. Пажљиво промишљање и зрело планирање и данас су од кључне важности за успех светих подухвата као што је било у Немијино време... Људи молитве треба да буду људи спремни за рад. Они који су спремни и вољни пронаћи ће начине и средства за рад. Немија ништа није препуштао случајности. Средства која није имао тражио је од оних који су могли да му их пруже.\n" +
                "Господ и даље покреће срца царева и владара у корист свога народа. Они који раде за Њега треба да искористе помоћ коју људи, подстакнути од стране Бога, дају за напредак Његовог дела... Ови људи можда не осећају наклоност према Божјем делу, немају веру у Христа, нити познају Његову реч; али њихове дарове због тога не треба одбити...\n" +
                "Док год смо на овоме свету, док год Божји Дух ради с људима, треба да примамо благослове, али и да их преносимо. Ми свету треба да дамо светлост истине која је откривена у Писму; и треба да примимо од света оно што му је Бог заповедио да учини у корист Његовог дела... О кад би хришћани могли потпуније схватити да је њихова предност и њихова дужност да, негујући права начела, искористе сваку Небом дату прилику за унапређење Божјег царства на овом свету. « (The Southern Work, 15. март 1904)\n");
        event.setDescription("»И би угодно цару, и пусти ме, кад му казах вријеме.« Немија 2,6.");
        result.add(event);

        event = new MorningVerse();
        event.setId(14);
        event.setTitle("»Зидајмо!«");
        event.setDate("15.09.2017");
        event.setText("»Посетилац жалосна срца посматрао је издалека разваљене одбрамбене зидове свог вољеног Јерусалима. Зар небески анђели не посматрају стање Христове цркве на исти начин? Попут становника Јерусалима навикли смо се на зло које влада, и често у свом задовољству не чинимо никакав напор у борби против њега. Али како на та зла гледају бића која поседују небеску светлост? Зар она, попут Немије, жалосна срца не посматрају разваљене зидове и капије нестале у ватри?« (The S.D.A. Bible Commentary 3:1136)\n" +
                "»Немија је имао царски налог који је обавезивао становнике да сарађују с њим у обнављању градских зидина, али он се није ослањао на свој ауторитет. Уместо тога трудио се да задобије поверење и наклоност људи, знајући да је заједништво срца као и заједништво радних руку неопходно за обављање великог дела које им је предстојало.« (Историја пророка и царева, стр. 637. оригинал)\n" +
                "»Потреба за Немијама постоји и данас у Цркви, не за људима који ће се само молити и проповедати, већ за људима чије су молитве и проповеди подупрте чврстом и одређеном намером... Успех који је пратио Немијине напоре показује шта могу учинити молитве, вера и мудра, одлучна акција... Дух који покажу вође у великој мери показаће се у народу. Ако вође које кажу да верују у свечане, важне истине које ће ставити на искушење свет у ово време, не покажу усрдну преданост у припреми људи да опстану у дан Господњи, морамо очекивати да Црква постане безбрижна, беспослена и склона уживању...\n" +
                "Немија је био реформатор, велики човек подигнут за важно време. Када је дошао у додир са злом и различитим противљењима, у њему се јавила нова храброст и жар. Његова енергија и одлучност надахнули су људе у Јерусалиму; а снага и храброст заменили слабост и обесхрабрење. Његове свете намере, његова узвишена нада, његова радосна посвећеност послу вршиле су утицај на друге. Народ је прихватио одушевљење свога вође, у чијем је делокругу сваки човек постао Немија, помажући и утврђујући руке и срце свога суседа.« (The S.D.A. Bible Commentary 3:1137)");
        event.setDescription("»И казах им како је добра рука Бога мојега нада мном... Тада рекоше: Устанимо и зидајмо. И укријепише им се руке на добро.« Немија 2,18.");
        result.add(event);

        return result;
    }
}
